stm32duino/ASM330LHH/src/asm330lhh_reg.h
#define ASM330LHH_WAKE_UP_DUR                  0x5CU
typedef struct {
  uint8_t sleep_dur                : 4;
  uint8_t wake_ths_w               : 1;
  uint8_t wake_dur                 : 2;
  uint8_t ff_dur                   : 1;
} asm330lhh_wake_up_dur_t;

#define ASM330LHH_FREE_FALL                    0x5DU
typedef struct {
  uint8_t ff_ths                   : 3;
  uint8_t ff_dur                   : 5;
} asm330lhh_free_fall_t;

#define ASM330LHH_MD1_CFG                      0x5EU
typedef struct {
  uint8_t not_used_01              : 2;
  uint8_t int1_6d                  : 1;
  uint8_t not_used_02              : 1;
  uint8_t int1_ff                  : 1;
  uint8_t int1_wu                  : 1;
  uint8_t not_used_03              : 1;
  uint8_t int1_sleep_change        : 1;
} asm330lhh_md1_cfg_t;

#define ASM330LHH_MD2_CFG                      0x5FU
typedef struct {
  uint8_t int2_timestamp           : 1;
  uint8_t not_used_01              : 1;
  uint8_t int2_6d                  : 1;
  uint8_t not_used_02              : 1;
  uint8_t int2_ff                  : 1;
  uint8_t int2_wu                  : 1;
  uint8_t not_used_03              : 1;
  uint8_t int2_sleep_change        : 1;
} asm330lhh_md2_cfg_t;

#define ASM330LHH_INTERNAL_FREQ_FINE           0x63U
typedef struct {
  uint8_t freq_fine                : 8;
} asm330lhh_internal_freq_fine_t;

#define ASM330LHH_X_OFS_USR                    0x73U
#define ASM330LHH_Y_OFS_USR                    0x74U
#define ASM330LHH_Z_OFS_USR                    0x75U
#define ASM330LHH_FIFO_DATA_OUT_TAG            0x78U
typedef struct {
  uint8_t tag_parity               : 1;
  uint8_t tag_cnt                  : 2;
  uint8_t tag_sensor               : 5;
} asm330lhh_fifo_data_out_tag_t;

#define ASM330LHH_FIFO_DATA_OUT_X_L            0x79U
#define ASM330LHH_FIFO_DATA_OUT_X_H            0x7AU
#define ASM330LHH_FIFO_DATA_OUT_Y_L            0x7BU
#define ASM330LHH_FIFO_DATA_OUT_Y_H            0x7CU
#define ASM330LHH_FIFO_DATA_OUT_Z_L            0x7DU
#define ASM330LHH_FIFO_DATA_OUT_Z_H            0x7EU

/**
  * @defgroup ASM330LHH_Register_Union
  * @brief    This union group all the registers that has a bit-field
  *           description.
  *           This union is useful but not need by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union{
  asm330lhh_pin_ctrl_t                      pin_ctrl;
  asm330lhh_fifo_ctrl1_t                    fifo_ctrl1;
  asm330lhh_fifo_ctrl2_t                    fifo_ctrl2;
  asm330lhh_fifo_ctrl3_t                    fifo_ctrl3;
  asm330lhh_fifo_ctrl4_t                    fifo_ctrl4;
  asm330lhh_counter_bdr_reg1_t              counter_bdr_reg1;
  asm330lhh_counter_bdr_reg2_t              counter_bdr_reg2;
  asm330lhh_int1_ctrl_t                     int1_ctrl;
  asm330lhh_int2_ctrl_t                     int2_ctrl;
  asm330lhh_ctrl1_xl_t                      ctrl1_xl;
  asm330lhh_ctrl2_g_t                       ctrl2_g;
  asm330lhh_ctrl3_c_t                       ctrl3_c;
  asm330lhh_ctrl4_c_t                       ctrl4_c;
  asm330lhh_ctrl5_c_t                       ctrl5_c;
  asm330lhh_ctrl6_g_t                       ctrl6_g;
  asm330lhh_ctrl7_g_t                       ctrl7_g;
  asm330lhh_ctrl8_xl_t                      ctrl8_xl;
  asm330lhh_ctrl9_xl_t                      ctrl9_xl;
  asm330lhh_ctrl10_c_t                      ctrl10_c;
  asm330lhh_all_int_src_t                   all_int_src;
  asm330lhh_wake_up_src_t                   wake_up_src;
  asm330lhh_tap_src_t                       tap_src;
  asm330lhh_d6d_src_t                       d6d_src;
  asm330lhh_status_reg_t                    status_reg;
  asm330lhh_fifo_status1_t                  fifo_status1;
  asm330lhh_fifo_status2_t                  fifo_status2;
  asm330lhh_int_cfg0_t                      tap_cfg0;
  asm330lhh_int_cfg1_t                      int_cfg1;
  asm330lhh_ths_6d_t                        ths_6d;
  asm330lhh_int_dur2_t                      int_dur2;
  asm330lhh_wake_up_ths_t                   wake_up_ths;
  asm330lhh_wake_up_dur_t                   wake_up_dur;
  asm330lhh_free_fall_t                     free_fall;
  asm330lhh_md1_cfg_t                       md1_cfg;
  asm330lhh_md2_cfg_t                       md2_cfg;
  asm330lhh_internal_freq_fine_t            internal_freq_fine;
  asm330lhh_fifo_data_out_tag_t             fifo_data_out_tag;
  bitwise_t                                 bitwise;
  uint8_t                                   byte;
} asm330lhh_reg_t;

/**
  * @}
  *
  */

int32_t asm330lhh_read_reg(asm330lhh_ctx_t *ctx, uint8_t reg, uint8_t* data,
                         uint16_t len);
int32_t asm330lhh_write_reg(asm330lhh_ctx_t *ctx, uint8_t reg, uint8_t* data,
                          uint16_t len);

extern float asm330lhh_from_fs2g_to_mg(int16_t lsb);
extern float asm330lhh_from_fs4g_to_mg(int16_t lsb);
extern float asm330lhh_from_fs8g_to_mg(int16_t lsb);
extern float asm330lhh_from_fs16g_to_mg(int16_t lsb);
extern float asm330lhh_from_fs125dps_to_mdps(int16_t lsb);
extern float asm330lhh_from_fs250dps_to_mdps(int16_t lsb);
extern float asm330lhh_from_fs500dps_to_mdps(int16_t lsb);
extern float asm330lhh_from_fs1000dps_to_mdps(int16_t lsb);
extern float asm330lhh_from_fs2000dps_to_mdps(int16_t lsb);
extern float asm330lhh_from_fs4000dps_to_mdps(int16_t lsb);
extern float asm330lhh_from_lsb_to_celsius(int16_t lsb);
extern float asm330lhh_from_lsb_to_nsec(int32_t lsb);

typedef enum {
  ASM330LHH_2g   = 0,
  ASM330LHH_16g  = 1, /* if XL_FS_MODE = ‘1’ -> ASM330LHH_2g */
  ASM330LHH_4g   = 2,
  ASM330LHH_8g   = 3,
} asm330lhh_fs_xl_t;
int32_t asm330lhh_xl_full_scale_set(asm330lhh_ctx_t *ctx, asm330lhh_fs_xl_t val);
int32_t asm330lhh_xl_full_scale_get(asm330lhh_ctx_t *ctx, asm330lhh_fs_xl_t *val);

typedef enum {
  ASM330LHH_XL_ODR_OFF    = 0,
  ASM330LHH_XL_ODR_12Hz5  = 1,
  ASM330LHH_XL_ODR_26Hz   = 2,
  ASM330LHH_XL_ODR_52Hz   = 3,
  ASM330LHH_XL_ODR_104Hz  = 4,
  ASM330LHH_XL_ODR_208Hz  = 5,
  ASM330LHH_XL_ODR_417Hz  = 6,
  ASM330LHH_XL_ODR_833Hz  = 7,
  ASM330LHH_XL_ODR_1667Hz = 8,
  ASM330LHH_XL_ODR_3333Hz = 9,
  ASM330LHH_XL_ODR_6667Hz = 10,
  ASM330LHH_XL_ODR_6Hz5   = 11, /* (low power only) */
} asm330lhh_odr_xl_t;
