stm32duino/ASM330LHH/src/asm330lhh_reg.h
int32_t asm330lhh_xl_data_rate_set(asm330lhh_ctx_t *ctx, asm330lhh_odr_xl_t val);
int32_t asm330lhh_xl_data_rate_get(asm330lhh_ctx_t *ctx, asm330lhh_odr_xl_t *val);

typedef enum {
  ASM330LHH_125dps = 2,
  ASM330LHH_250dps = 0,
  ASM330LHH_500dps = 4,
  ASM330LHH_1000dps = 8,
  ASM330LHH_2000dps = 12,
  ASM330LHH_4000dps = 1,
} asm330lhh_fs_g_t;
int32_t asm330lhh_gy_full_scale_set(asm330lhh_ctx_t *ctx, asm330lhh_fs_g_t val);
int32_t asm330lhh_gy_full_scale_get(asm330lhh_ctx_t *ctx, asm330lhh_fs_g_t *val);

typedef enum {
  ASM330LHH_GY_ODR_OFF    = 0,
  ASM330LHH_GY_ODR_12Hz5  = 1,
  ASM330LHH_GY_ODR_26Hz   = 2,
  ASM330LHH_GY_ODR_52Hz   = 3,
  ASM330LHH_GY_ODR_104Hz  = 4,
  ASM330LHH_GY_ODR_208Hz  = 5,
  ASM330LHH_GY_ODR_417Hz  = 6,
  ASM330LHH_GY_ODR_833Hz  = 7,
  ASM330LHH_GY_ODR_1667Hz = 8,
  ASM330LHH_GY_ODR_3333Hz = 9,
  ASM330LHH_GY_ODR_6667Hz = 10,
} asm330lhh_odr_g_t;
int32_t asm330lhh_gy_data_rate_set(asm330lhh_ctx_t *ctx,
                                 asm330lhh_odr_g_t val);
int32_t asm330lhh_gy_data_rate_get(asm330lhh_ctx_t *ctx,
                                 asm330lhh_odr_g_t *val);

int32_t asm330lhh_block_data_update_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_block_data_update_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_LSb_1mg  = 0,
  ASM330LHH_LSb_16mg = 1,
} asm330lhh_usr_off_w_t;
int32_t asm330lhh_xl_offset_weight_set(asm330lhh_ctx_t *ctx,
                                     asm330lhh_usr_off_w_t val);
int32_t asm330lhh_xl_offset_weight_get(asm330lhh_ctx_t *ctx,
                                     asm330lhh_usr_off_w_t *val);

typedef struct {
  asm330lhh_all_int_src_t       all_int_src;
  asm330lhh_wake_up_src_t       wake_up_src;
  asm330lhh_tap_src_t           tap_src;
  asm330lhh_d6d_src_t           d6d_src;
  asm330lhh_status_reg_t        status_reg;
  } asm330lhh_all_sources_t;
int32_t asm330lhh_all_sources_get(asm330lhh_ctx_t *ctx,
                                asm330lhh_all_sources_t *val);

int32_t asm330lhh_status_reg_get(asm330lhh_ctx_t *ctx,
                                 asm330lhh_status_reg_t *val);

int32_t asm330lhh_xl_flag_data_ready_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_gy_flag_data_ready_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_temp_flag_data_ready_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_xl_usr_offset_x_set(asm330lhh_ctx_t *ctx, uint8_t *buff);
int32_t asm330lhh_xl_usr_offset_x_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_xl_usr_offset_y_set(asm330lhh_ctx_t *ctx, uint8_t *buff);
int32_t asm330lhh_xl_usr_offset_y_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_xl_usr_offset_z_set(asm330lhh_ctx_t *ctx, uint8_t *buff);
int32_t asm330lhh_xl_usr_offset_z_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_xl_usr_offset_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_xl_usr_offset_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_timestamp_rst(asm330lhh_ctx_t *ctx);

int32_t asm330lhh_timestamp_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_timestamp_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_timestamp_raw_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

typedef enum {
  ASM330LHH_NO_ROUND      = 0,
  ASM330LHH_ROUND_XL      = 1,
  ASM330LHH_ROUND_GY      = 2,
  ASM330LHH_ROUND_GY_XL   = 3,
} asm330lhh_rounding_t;
int32_t asm330lhh_rounding_mode_set(asm330lhh_ctx_t *ctx,
                                  asm330lhh_rounding_t val);
int32_t asm330lhh_rounding_mode_get(asm330lhh_ctx_t *ctx,
                                  asm330lhh_rounding_t *val);

int32_t asm330lhh_temperature_raw_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_angular_rate_raw_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_acceleration_raw_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_fifo_out_raw_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_device_conf_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_device_conf_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_odr_cal_reg_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_odr_cal_reg_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_DRDY_LATCHED = 0,
  ASM330LHH_DRDY_PULSED  = 1,
} asm330lhh_dataready_pulsed_t;
int32_t asm330lhh_data_ready_mode_set(asm330lhh_ctx_t *ctx,
                                    asm330lhh_dataready_pulsed_t val);
int32_t asm330lhh_data_ready_mode_get(asm330lhh_ctx_t *ctx,
                                    asm330lhh_dataready_pulsed_t *val);

int32_t asm330lhh_device_id_get(asm330lhh_ctx_t *ctx, uint8_t *buff);

int32_t asm330lhh_reset_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_reset_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_auto_increment_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_auto_increment_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_boot_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_boot_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_XL_ST_DISABLE  = 0,
  ASM330LHH_XL_ST_POSITIVE = 1,
  ASM330LHH_XL_ST_NEGATIVE = 2,
} asm330lhh_st_xl_t;
int32_t asm330lhh_xl_self_test_set(asm330lhh_ctx_t *ctx, asm330lhh_st_xl_t val);
int32_t asm330lhh_xl_self_test_get(asm330lhh_ctx_t *ctx, asm330lhh_st_xl_t *val);

typedef enum {
  ASM330LHH_GY_ST_DISABLE  = 0,
  ASM330LHH_GY_ST_POSITIVE = 1,
  ASM330LHH_GY_ST_NEGATIVE = 3,
} asm330lhh_st_g_t;
int32_t asm330lhh_gy_self_test_set(asm330lhh_ctx_t *ctx, asm330lhh_st_g_t val);
int32_t asm330lhh_gy_self_test_get(asm330lhh_ctx_t *ctx, asm330lhh_st_g_t *val);

int32_t asm330lhh_xl_filter_lp2_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_xl_filter_lp2_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_gy_filter_lp1_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_gy_filter_lp1_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_filter_settling_mask_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_filter_settling_mask_get(asm330lhh_ctx_t *ctx, uint8_t *val);

