stm32duino/ASM330LHH/src/asm330lhh_reg.h
typedef enum {
  ASM330LHH_DRIVE_SLEEP_CHG_EVENT = 0,
  ASM330LHH_DRIVE_SLEEP_STATUS    = 1,
} asm330lhh_sleep_status_on_int_t;
int32_t asm330lhh_act_pin_notification_set(asm330lhh_ctx_t *ctx,
                                         asm330lhh_sleep_status_on_int_t val);
int32_t asm330lhh_act_pin_notification_get(asm330lhh_ctx_t *ctx,
                                         asm330lhh_sleep_status_on_int_t *val);

typedef enum {
  ASM330LHH_XL_AND_GY_NOT_AFFECTED      = 0,
  ASM330LHH_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  ASM330LHH_XL_12Hz5_GY_SLEEP           = 2,
  ASM330LHH_XL_12Hz5_GY_PD              = 3,
} asm330lhh_inact_en_t;
int32_t asm330lhh_act_mode_set(asm330lhh_ctx_t *ctx,
                             asm330lhh_inact_en_t val);
int32_t asm330lhh_act_mode_get(asm330lhh_ctx_t *ctx,
                             asm330lhh_inact_en_t *val);

int32_t asm330lhh_act_sleep_dur_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_act_sleep_dur_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_DEG_80  = 0,
  ASM330LHH_DEG_70  = 1,
  ASM330LHH_DEG_60  = 2,
  ASM330LHH_DEG_50  = 3,
} asm330lhh_sixd_ths_t;
int32_t asm330lhh_6d_threshold_set(asm330lhh_ctx_t *ctx,
                                 asm330lhh_sixd_ths_t val);
int32_t asm330lhh_6d_threshold_get(asm330lhh_ctx_t *ctx,
                                 asm330lhh_sixd_ths_t *val);

int32_t asm330lhh_4d_mode_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_4d_mode_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_FF_TSH_156mg = 0,
  ASM330LHH_FF_TSH_219mg = 1,
  ASM330LHH_FF_TSH_250mg = 2,
  ASM330LHH_FF_TSH_312mg = 3,
  ASM330LHH_FF_TSH_344mg = 4,
  ASM330LHH_FF_TSH_406mg = 5,
  ASM330LHH_FF_TSH_469mg = 6,
  ASM330LHH_FF_TSH_500mg = 7,
} asm330lhh_ff_ths_t;
int32_t asm330lhh_ff_threshold_set(asm330lhh_ctx_t *ctx,
                                 asm330lhh_ff_ths_t val);
int32_t asm330lhh_ff_threshold_get(asm330lhh_ctx_t *ctx,
                                 asm330lhh_ff_ths_t *val);

int32_t asm330lhh_ff_dur_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_ff_dur_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_fifo_watermark_set(asm330lhh_ctx_t *ctx, uint16_t val);
int32_t asm330lhh_fifo_watermark_get(asm330lhh_ctx_t *ctx, uint16_t *val);

int32_t asm330lhh_fifo_virtual_sens_odr_chg_set(asm330lhh_ctx_t *ctx,
                                              uint8_t val);
int32_t asm330lhh_fifo_virtual_sens_odr_chg_get(asm330lhh_ctx_t *ctx,
                                              uint8_t *val);

int32_t asm330lhh_fifo_stop_on_wtm_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_fifo_stop_on_wtm_get(asm330lhh_ctx_t *ctx, uint8_t *val);

typedef enum {
  ASM330LHH_XL_NOT_BATCHED        =  0,
  ASM330LHH_XL_BATCHED_AT_12Hz5   =  1,
  ASM330LHH_XL_BATCHED_AT_26Hz    =  2,
  ASM330LHH_XL_BATCHED_AT_52Hz    =  3,
  ASM330LHH_XL_BATCHED_AT_104Hz   =  4,
  ASM330LHH_XL_BATCHED_AT_208Hz   =  5,
  ASM330LHH_XL_BATCHED_AT_417Hz   =  6,
  ASM330LHH_XL_BATCHED_AT_833Hz   =  7,
  ASM330LHH_XL_BATCHED_AT_1667Hz  =  8,
  ASM330LHH_XL_BATCHED_AT_3333Hz  =  9,
  ASM330LHH_XL_BATCHED_AT_6667Hz  = 10,
  ASM330LHH_XL_BATCHED_AT_6Hz5    = 11,
} asm330lhh_bdr_xl_t;
int32_t asm330lhh_fifo_xl_batch_set(asm330lhh_ctx_t *ctx, asm330lhh_bdr_xl_t val);
int32_t asm330lhh_fifo_xl_batch_get(asm330lhh_ctx_t *ctx, asm330lhh_bdr_xl_t *val);

typedef enum {
  ASM330LHH_GY_NOT_BATCHED         = 0,
  ASM330LHH_GY_BATCHED_AT_12Hz5    = 1,
  ASM330LHH_GY_BATCHED_AT_26Hz     = 2,
  ASM330LHH_GY_BATCHED_AT_52Hz     = 3,
  ASM330LHH_GY_BATCHED_AT_104Hz    = 4,
  ASM330LHH_GY_BATCHED_AT_208Hz    = 5,
  ASM330LHH_GY_BATCHED_AT_417Hz    = 6,
  ASM330LHH_GY_BATCHED_AT_833Hz    = 7,
  ASM330LHH_GY_BATCHED_AT_1667Hz   = 8,
  ASM330LHH_GY_BATCHED_AT_3333Hz   = 9,
  ASM330LHH_GY_BATCHED_AT_6667Hz   = 10,
  ASM330LHH_GY_BATCHED_6Hz5        = 11,
} asm330lhh_bdr_gy_t;
int32_t asm330lhh_fifo_gy_batch_set(asm330lhh_ctx_t *ctx, asm330lhh_bdr_gy_t val);
int32_t asm330lhh_fifo_gy_batch_get(asm330lhh_ctx_t *ctx, asm330lhh_bdr_gy_t *val);

typedef enum {
  ASM330LHH_BYPASS_MODE             = 0,
  ASM330LHH_FIFO_MODE               = 1,
  ASM330LHH_STREAM_TO_FIFO_MODE     = 3,
  ASM330LHH_BYPASS_TO_STREAM_MODE   = 4,
  ASM330LHH_STREAM_MODE             = 6,
  ASM330LHH_BYPASS_TO_FIFO_MODE     = 7,
} asm330lhh_fifo_mode_t;
int32_t asm330lhh_fifo_mode_set(asm330lhh_ctx_t *ctx, asm330lhh_fifo_mode_t val);
int32_t asm330lhh_fifo_mode_get(asm330lhh_ctx_t *ctx, asm330lhh_fifo_mode_t *val);

typedef enum {
  ASM330LHH_TEMP_NOT_BATCHED        = 0,
  ASM330LHH_TEMP_BATCHED_AT_52Hz    = 1,
  ASM330LHH_TEMP_BATCHED_AT_12Hz5   = 2,
  ASM330LHH_TEMP_BATCHED_AT_1Hz6    = 3,
} asm330lhh_odr_t_batch_t;
int32_t asm330lhh_fifo_temp_batch_set(asm330lhh_ctx_t *ctx,
                                    asm330lhh_odr_t_batch_t val);
int32_t asm330lhh_fifo_temp_batch_get(asm330lhh_ctx_t *ctx,
                                    asm330lhh_odr_t_batch_t *val);

typedef enum {
  ASM330LHH_NO_DECIMATION = 0,
  ASM330LHH_DEC_1         = 1,
  ASM330LHH_DEC_8         = 2,
  ASM330LHH_DEC_32        = 3,
} asm330lhh_odr_ts_batch_t;
int32_t asm330lhh_fifo_timestamp_decimation_set(asm330lhh_ctx_t *ctx,
                                              asm330lhh_odr_ts_batch_t val);
int32_t asm330lhh_fifo_timestamp_decimation_get(asm330lhh_ctx_t *ctx,
                                              asm330lhh_odr_ts_batch_t *val);

typedef enum {
  ASM330LHH_XL_BATCH_EVENT   = 0,
  ASM330LHH_GYRO_BATCH_EVENT = 1,
} asm330lhh_trig_counter_bdr_t;
int32_t asm330lhh_fifo_cnt_event_batch_set(asm330lhh_ctx_t *ctx,
                                         asm330lhh_trig_counter_bdr_t val);
int32_t asm330lhh_fifo_cnt_event_batch_get(asm330lhh_ctx_t *ctx,
                                         asm330lhh_trig_counter_bdr_t *val);

int32_t asm330lhh_rst_batch_counter_set(asm330lhh_ctx_t *ctx, uint8_t val);
int32_t asm330lhh_rst_batch_counter_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_batch_counter_threshold_set(asm330lhh_ctx_t *ctx,
                                            uint16_t val);
int32_t asm330lhh_batch_counter_threshold_get(asm330lhh_ctx_t *ctx,
                                            uint16_t *val);

int32_t asm330lhh_fifo_data_level_get(asm330lhh_ctx_t *ctx, uint16_t *val);

int32_t asm330lhh_fifo_status_get(asm330lhh_ctx_t *ctx,
                                asm330lhh_fifo_status2_t *val);

int32_t asm330lhh_fifo_full_flag_get(asm330lhh_ctx_t *ctx, uint8_t *val);

int32_t asm330lhh_fifo_ovr_flag_get(asm330lhh_ctx_t *ctx, uint8_t *val);

